app/views/users/edit.html.erb

SELECT "locations"."name", "locations"."id" FROM "locations"
---

  <!-- <%#= f.select :location_id, Location.pluck(:name, :id), :include_blank => true %> -->