app/views/users/show.html.erb

SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 14]]
---
        <li class="show-info"><strong>Places Visited:</strong>
            <% @user.location.each do |location| %>