app/controllers/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "phani@abc.com"]]
---
  def create
    user = User.find_by :email => params[:email]