app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["name", "rama"], ["email", "rama@abc.com"], ["password_digest", "$2a$10$uG6x27rtZihV8r4Fmvlt3uGODX.UTujCxOEJDL6bM/Ic0v/FbPvD."]]
---
  def create
    @user = User.new user_params
    # # raise "help"
    # @user.image = req["url"]
    if @user.save

SELECT locations.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8688197 - locations.latitude) * PI() / 180 / 2), 2) + COS(-33.8688197 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((151.2092955 - locations.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((locations.longitude - 151.2092955) / 57.2957795), ((locations.latitude - -33.8688197) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "locations" WHERE (locations.latitude BETWEEN -34.01355148311085 AND -33.724087916889154 AND locations.longitude BETWEEN 151.03498615540607 AND 151.38360484459392 AND (3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8688197 - locations.latitude) * PI() / 180 / 2), 2) + COS(-33.8688197 * PI() / 180) * COS(locations.latitude * PI() / 180) * POWER(SIN((151.2092955 - locations.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10 AND locations.id != 16)  ORDER BY distance ASC
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT 1  [["id", 0]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
---
  def search
    if params[:name].present?
      @pic_references = []
      locals = Location.where('name ILIKE ?', '%' + params[:name] + '%')
      # raise "hell"
      # @users = User.where(:location => locals)
      @users = Location.find(locals[0].id).users

INSERT INTO "locations" ("name", "latitude", "longitude") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hyderabad"], ["latitude", 17.385044], ["longitude", 78.486671]]
SELECT  "locations".* FROM "locations" WHERE "locations"."name" = $1 LIMIT 1  [["name", "Sydney"]]
UPDATE "users" SET "name" = $1, "fbookid" = $2, "image" = $3 WHERE "users"."id" = $4  [["name", "PhaniGanti"], ["fbookid", ""], ["image", ""], ["id", 13]]
---
  def update

    # This is the magic stuff that will let us upload an image to Cloudinary when creating a new animal.
    @user = @current_user
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @user.image = req["url"]
      location = Location.find_or_create_by(:name => params[:user][:location])
      # raise "hell"
      if @user.update user_params